TsunghsienWu/wm8850/ANDROID_3.0.8/drivers/net/wireless/rtl8723vau/rtl8723A_WiFi_linux_v4.1.1_4756.20120731/core/rtw_bt_mp.c
/******************************************************************************
 *
 * Copyright(c) 2007 - 2011 Realtek Corporation. All rights reserved.
 *										  
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program; if not, write to the Free Software Foundation, Inc.,
 * 51 Franklin Street, Fifth Floor, Boston, MA 02110, USA
 *
 *
 ******************************************************************************/

#include "rtw_bt_mp.h"
#include <drv_types.h>
#include <rtl8723a_hal.h>

void MPh2c_timeout_handle(void *FunctionContext)
{
	_adapter *pAdapter = (_adapter *)FunctionContext;
	PMPT_CONTEXT		pMptCtx=&pAdapter->mppriv.MptCtx;

	DBG_8192C("[MPT], MPh2c_timeout_handle \n");

	pMptCtx->bMPh2c_timeout=_TRUE;
	
	_rtw_up_sema(&pMptCtx->MPh2c_Sema);
	
	//_cancel_timer_ex( &pMptCtx->MPh2c_timeout_timer);
	
	return;
}
u32 WaitC2Hevent( PADAPTER pAdapter,BOOLEAN *C2H_event ,u32 delay_time)
{
	PMPT_CONTEXT		pMptCtx=&(pAdapter->mppriv.MptCtx);
	pMptCtx->bMPh2c_timeout=_FALSE;
	
	_set_timer( &pMptCtx->MPh2c_timeout_timer, delay_time );
	
	_rtw_down_sema(&pMptCtx->MPh2c_Sema);

	if( pMptCtx->bMPh2c_timeout == _TRUE )
	{
		C2H_event =_FALSE;
		
		return _FALSE;
	}
	
	return _TRUE;
	
}

BT_CTRL_STATUS
mptbt_CheckC2hFrame(
	PADAPTER		Adapter,
	PBT_H2C			pH2c,
	PBT_EXT_C2H		pExtC2h
	)
{
	BT_CTRL_STATUS	c2hStatus = BT_STATUS_C2H_SUCCESS;
		
	//DBG_8192C("[MPT], MPT rsp C2H hex: %x %x %x  %x %x %x \n"), pExtC2h , pExtC2h+1 ,pExtC2h+2 ,pExtC2h+3 ,pExtC2h+4 ,pExtC2h+5);

	DBG_8192C("[MPT], statusCode = 0x%x\n", pExtC2h->statusCode);
	DBG_8192C("[MPT], retLen = %d\n", pExtC2h->retLen);
	DBG_8192C("[MPT], opCodeVer : req/rsp=%d/%d\n", pH2c->opCodeVer, pExtC2h->opCodeVer);
	DBG_8192C("[MPT], reqNum : req/rsp=%d/%d\n", pH2c->reqNum, pExtC2h->reqNum);
	if(pExtC2h->reqNum != pH2c->reqNum)
	{
		c2hStatus = BT_STATUS_C2H_REQNUM_MISMATCH;
		DBG_8192C("[MPT], Error!! C2H reqNum Mismatch!!\n");
	}
	else if(pExtC2h->opCodeVer != pH2c->opCodeVer)
	{
		c2hStatus = BT_STATUS_OPCODE_L_VERSION_MISMATCH;
		DBG_8192C("[MPT], Error!! OPCode version L mismatch!!\n");
	}

	return c2hStatus;
}

extern s32 FillH2CCmd(PADAPTER padapter, u8 ElementID, u32 CmdLen, u8 *pCmdBuffer);

BT_CTRL_STATUS
mptbt_SendH2c(
	PADAPTER	Adapter,
	PBT_H2C	pH2c,
	u2Byte		h2cCmdLen
	)
{
	//KIRQL				OldIrql = KeGetCurrentIrql();
	BT_CTRL_STATUS	h2cStatus=BT_STATUS_H2C_SUCCESS;
	PMPT_CONTEXT		pMptCtx=&(Adapter->mppriv.MptCtx);
	u1Byte				i;

	DBG_8192C("[MPT], mptbt_SendH2c()=========>\n");

	//PlatformResetEvent(&pMptCtx->MptH2cRspEvent);
	//PlatformResetEvent(&pMptCtx->MptBtC2hEvent);
	
//	if(OldIrql == PASSIVE_LEVEL)
//	{
		//RTPRINT_DATA(FMPBT, FMPBT_H2C_CONTENT, ("[MPT], MPT H2C hex: \n"), pH2c, h2cCmdLen);

		for(i=0; i<BT_H2C_MAX_RETRY; i++)
		{
			DBG_8192C("[MPT], Send H2C command to wifi!!!\n");
			FillH2CCmd(Adapter, 70, h2cCmdLen, (pu1Byte)pH2c);
			pMptCtx->h2cReqNum++;
			pMptCtx->h2cReqNum %= 16;

			if(WaitC2Hevent(Adapter, &pMptCtx->MptH2cRspEvent, 100))
			{
				DBG_8192C("[MPT], Received MptH2cRspEvent!!!\n");
				if(WaitC2Hevent(Adapter, &pMptCtx->MptBtC2hEvent, 400))
				{
					DBG_8192C("[MPT], Received MptBtC2hEvent!!!\n");
					break;
				}
				else
				{
					DBG_8192C("[MPT], Error!! MptBtC2hEvent timeout!!\n");
					h2cStatus = BT_STATUS_H2C_BT_NO_RSP;
				}
			}
			else
			{
				DBG_8192C("[MPT], Error!! MptH2cRspEvent timeout!!\n");
				h2cStatus = BT_STATUS_H2C_TIMTOUT;
			}
		}
//	}
//	else
//	{
//		RT_ASSERT(FALSE, ("[MPT],  mptbt_SendH2c() can only run under PASSIVE_LEVEL!!\n"));
//		h2cStatus = BT_STATUS_WRONG_LEVEL;
//	}

	DBG_8192C("[MPT], mptbt_SendH2c()<=========\n");
	return h2cStatus;
}



BT_CTRL_STATUS
mptbt_CheckBtRspStatus(
	PADAPTER			Adapter,
	PBT_EXT_C2H			pExtC2h
	)
{
	BT_CTRL_STATUS	retStatus=BT_OP_STATUS_SUCCESS;

	switch(pExtC2h->statusCode)
	{
		case BT_OP_STATUS_SUCCESS:
			retStatus = BT_STATUS_BT_OP_SUCCESS;
			DBG_8192C("[MPT], BT status : BT_STATUS_SUCCESS\n");
			break;
		case BT_OP_STATUS_VERSION_MISMATCH:
			retStatus = BT_STATUS_OPCODE_L_VERSION_MISMATCH;
			DBG_8192C("[MPT], BT status : BT_STATUS_OPCODE_L_VERSION_MISMATCH\n");
			break;
		case BT_OP_STATUS_UNKNOWN_OPCODE:
			retStatus = BT_STATUS_UNKNOWN_OPCODE_L;
			DBG_8192C("[MPT], BT status : BT_STATUS_UNKNOWN_OPCODE_L\n");
			break;
		case BT_OP_STATUS_ERROR_PARAMETER:
			retStatus = BT_STATUS_PARAMETER_FORMAT_ERROR_L;
			DBG_8192C("[MPT], BT status : BT_STATUS_PARAMETER_FORMAT_ERROR_L\n");
			break;
		default:
			retStatus = BT_STATUS_UNKNOWN_STATUS_L;
			DBG_8192C("[MPT], BT status : BT_STATUS_UNKNOWN_STATUS_L\n");
			break;
	}
	
	return retStatus;
}	



BT_CTRL_STATUS
mptbt_BtFwOpCodeProcess(
	PADAPTER		Adapter,
	u1Byte			btFwOpCode,
	u1Byte			opCodeVer,
	pu1Byte			pH2cPar,
	u1Byte			h2cParaLen
	)
{
	u1Byte				H2C_Parameter[6] ={0};
	PBT_H2C				pH2c=(PBT_H2C)&H2C_Parameter[0];
	PMPT_CONTEXT		pMptCtx=&(Adapter->mppriv.MptCtx);
	PBT_EXT_C2H			pExtC2h=(PBT_EXT_C2H)&pMptCtx->c2hBuf[0];
	u2Byte				paraLen=0,i;
	BT_CTRL_STATUS	h2cStatus=BT_STATUS_H2C_SUCCESS, c2hStatus=BT_STATUS_C2H_SUCCESS;
	BT_CTRL_STATUS	retStatus=BT_STATUS_H2C_BT_NO_RSP;

	pH2c->opCode = btFwOpCode;
	pH2c->opCodeVer = opCodeVer;
	pH2c->reqNum = pMptCtx->h2cReqNum;
	//PlatformMoveMemory(&pH2c->buf[0], pH2cPar, h2cParaLen);
	_rtw_memcpy(&pH2c->buf[0], pH2cPar, h2cParaLen);
	
	DBG_8192C("[MPT], pH2c->opCode=%d\n", pH2c->opCode);
	DBG_8192C("[MPT], pH2c->opCodeVer=%d\n", pH2c->opCodeVer);
	DBG_8192C("[MPT], pH2c->reqNum=%d\n", pH2c->reqNum);
	DBG_8192C("[MPT], h2c parameter length=%d\n", h2cParaLen);
	if(h2cParaLen)
	{
		DBG_8192C("[MPT], parameters(hex): \n");
		for(i=0;i<=h2cParaLen;i++)
		{
			DBG_8192C(" 0x%x ", pH2c->buf[i]);
		}
	}

	h2cStatus = mptbt_SendH2c(Adapter, pH2c, h2cParaLen+2);
	if(BT_STATUS_H2C_SUCCESS == h2cStatus)
	{
		// if reach here, it means H2C get the correct c2h response, 
		c2hStatus = mptbt_CheckC2hFrame(Adapter, pH2c, pExtC2h);
		if(BT_STATUS_C2H_SUCCESS == c2hStatus)
		{
			retStatus = mptbt_CheckBtRspStatus(Adapter, pExtC2h);
		}
		else
		{
			DBG_8192C("[MPT], Error!! C2H failed for pH2c->opCode=%d\n", pH2c->opCode);
			// check c2h status error, return error status code to upper layer.
			retStatus = c2hStatus;
		}
	}
	else
	{
		DBG_8192C("[MPT], Error!! H2C failed for pH2c->opCode=%d\n", pH2c->opCode);
		// check h2c status error, return error status code to upper layer.
		retStatus = h2cStatus;
	}

